using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows;
using System.Windows.Controls;
using System.Windows.Data;
using System.Windows.Documents;
using System.Windows.Input;
using System.Windows.Media;
using System.Windows.Media.Imaging;
using System.Windows.Navigation;
using System.Windows.Shapes;
using WpfApp.Model;

namespace WpfApp.Admin
{
	/// <summary>
	/// Логика взаимодействия для ClientsPage.xaml
	/// </summary>
	public partial class ClientsPage : Page
	{
		private WarEntities db;
		public List<string> Регионы { get; set; }

		public ClientsPage()
		{
			InitializeComponent();
			db = new WarEntities();
			LoadData();
			this.DataContext = this;
			Регионы = GetRussianRegions();
		}

		private void LoadData()
		{
			var клиенты = (from клиент in db.Клиент
						   join адрес in db.Адрес on клиент.Адрес equals адрес.Номер
						   select new КлиентData
						   {
							   Номер = клиент.Номер,
							   Название = клиент.Название,
							   Tелефон = клиент.Tелефон,
							   Email = клиент.Email,
							   Субъект = адрес.Субъект,
							   Город = адрес.Город,
							   Улица = адрес.Улица,
							   Дом = адрес.Дом,
						   }).ToList();

			КлиентыDataGrid.ItemsSource = клиенты;
		}

		private List<string> GetRussianRegions()
		{
			return new List<string>
			{
				"Республика Адыгея",
				"Республика Башкортостан",
				"Республика Бурятия",
				"Республика Алтай",
				"Республика Дагестан",
				"Республика Ингушетия",
				"Кабардино-Балкарская Республика",
				"Республика Калмыкия",
				"Карачаево-Черкесская Республика",
				"Республика Карелия",
				"Республика Коми",
				"Республика Марий Эл",
				"Республика Мордовия",
				"Республика Саха (Якутия)",
				"Республика Северная Осетия - Алания",
				"Республика Татарстан (Татарстан)",
				"Республика Тыва",
				"Удмуртская Республика",
				"Республика Хакасия",
				"Чеченская Республика",
				"Чувашская Республика - Чувашия",
				"Алтайский край",
				"Краснодарский край",
				"Красноярский край",
				"Приморский край",
				"Ставропольский край",
				"Хабаровский край",
				"Амурская область",
				"Архангельская область",
				"Астраханская область",
				"Белгородская область",
				"Брянская область",
				"Владимирская область",
				"Волгоградская область",
				"Вологодская область",
				"Воронежская область",
				"Ивановская область",
				"Иркутская область",
				"Калининградская область",
				"Калужская область",
				"Камчатский край",
				"Кемеровская область - Кузбасс",
				"Кировская область",
				"Костромская область",
				"Курганская область",
				"Курская область",
				"Ленинградская область",
				"Липецкая область",
				"Магаданская область",
				"Московская область",
				"Мурманская область",
				"Нижегородская область",
				"Новгородская область",
				"Новосибирская область",
				"Омская область",
				"Оренбургская область",
				"Орловская область",
				"Пензенская область",
				"Пермский край",
				"Псковская область",
				"Ростовская область",
				"Рязанская область",
				"Самарская область",
				"Саратовская область",
				"Сахалинская область",
				"Свердловская область",
				"Смоленская область",
				"Тамбовская область",
				"Тверская область",
				"Томская область",
				"Тульская область",
				"Тюменская область",
				"Ульяновская область",
				"Челябинская область",
				"Забайкальский край",
				"Ярославская область",
				"г. Москва",
				"г. Санкт-Петербург",
				"Еврейская автономная область",
				"Ненецкий автономный округ",
				"Ханты-Мансийский автономный округ - Югра",
				"Чукотский автономный округ",
				"Ямало-Ненецкий автономный округ",
				"Республика Крым",
				"г. Севастополь",
				"иные территории, включая город и космодром Байконур",
			};
		}
		private void СохранитьИзмененияКлиент()
		{
			var измененныеКлиент = КлиентыDataGrid.ItemsSource as List<КлиентData>;
			if (измененныеКлиент != null)
			{
				foreach (var данные in измененныеКлиент)
				{
					var клиент = db.Клиент.FirstOrDefault(s => s.Номер == данные.Номер);
					if (клиент != null)
					{
						клиент.Название = данные.Название;
						клиент.Tелефон = данные.Tелефон;
						клиент.Email = данные.Email;

						var адрес = db.Адрес.FirstOrDefault(a => a.Номер == клиент.Адрес);
						if (адрес != null)
						{
							адрес.Субъект = данные.Субъект;
							адрес.Город = данные.Город;
							адрес.Улица = данные.Улица;
							адрес.Дом = данные.Дом;
						}
					}
					else
					{
						var новыйАдрес = new Адрес
						{
							Страна = "Россия",
							Субъект = данные.Субъект,
							Город = данные.Город,
							Улица = данные.Улица,
							Дом = данные.Дом
						};
						db.Адрес.Add(новыйАдрес);
						db.SaveChanges();

						var новыйКлиент = new Клиент
						{
							Название = данные.Название,
							Tелефон = данные.Tелефон,
							Email = данные.Email,
							Адрес = новыйАдрес.Номер
						};
						db.Клиент.Add(новыйКлиент);
					}
				}
				db.SaveChanges();
			}
		}

		private void СохранитьКлиенты_Click(object sender, RoutedEventArgs e)
		{
			try
			{
				СохранитьИзмененияКлиент();
				MessageBox.Show("Изменения сохранены.");
			}
			catch (Exception ex)
			{
				MessageBox.Show($"Ошибка при сохранении: {ex.Message}");
			}
		}

		private void УдалитьКлиента_Click(object sender, RoutedEventArgs e)
		{
			var selectedItem = КлиентыDataGrid.SelectedItem as dynamic;
			if (selectedItem != null)
			{
				try
				{
					int номерКлиента = selectedItem.Номер;
					var клиент = db.Клиент.Find(номерКлиента);
					if (клиент != null)
					{
						db.Клиент.Remove(клиент);
						db.SaveChanges();
						LoadData();
						MessageBox.Show("Запись успешно удалена.");
					}
				}
				catch (Exception ex)
				{
					MessageBox.Show($"Ошибка при удалении: {ex.Message}");
				}
			}
			else
			{
				MessageBox.Show("Выберите запись для удаления.");
			}
		}
	}
}